TimeDJ/app/controllers/city_controller.rb

SELECT * FROM `cities` WHERE (`cities`.country_id = 0)
---
  def index
     @cities = City.find(:all)