TimeDJ/app/controllers/recipes_controller.rb

  def index
    @recipes = Recipe.all
    @cities = City.all
---
SELECT * FROM `recipes`
SELECT * FROM `cities`

  def show
    @recipe = Recipe.find(params[:id])
---
SELECT * FROM `recipes` WHERE (`recipes`.`id` = 1)

  def create
    @recipe = Recipe.new(params[:recipe])

    respond_to do |format|
      if @recipe.save
---
INSERT INTO `recipes` (`created_at`, `title`, `author`, `updated_at`, `description`) VALUES('2010-02-14 00:17:09', 'First', 'Second', '2010-02-14 00:17:09', 'Third')