app/controllers/query_controller.rb

SELECT * FROM `countries` WHERE (`countries`.`id` = 22)
---
  def index
     @cities = City.find(:all)
     @countries = Country.find(:all)