app/controllers/query_controller.rb

SELECT * FROM `cities` WHERE (name = 'San Francisco') LIMIT 1
SELECT * FROM `countries` WHERE (`countries`.`id` = 1)
---
        end
        lookup_params[:name] = city.strip.squeeze(' ')
        lookup_params[:region_id] = Region.find(:first, :conditions => {:name => region.strip.squeeze(' ')}) if region
        lookup_params[:country_id] = Country.find(:first, :conditions => {:name => country.gsub(/\(.*/,"").strip.squeeze(' ')}) if country
        city = City.find(:first, :conditions => lookup_params, :order => ordering)

        # Try one more time assuming only city and region
        # This should be much more elegant...
        if !city && my_params.size == 2
          city = my_params[0]
          region = abbrev_to_region[my_params[1].strip] || my_params[1]
          country = nil
          ordering = "population DESC"
          lookup_params = {}
          lookup_params[:name] = city.strip.squeeze(' ')
          lookup_params[:region_id] = Region.find(:first, :conditions => {:name => region.strip.squeeze(' ')}) if region
          lookup_params[:country_id] = Country.find(:first, :conditions => {:name => country.gsub(/\(.*/,"").strip.squeeze(' ')}) if country
          city = City.find(:first, :conditions => lookup_params, :order => ordering)
        end

        # check if we were able to find this city
        # if the user didn't use autocomplete chances are we may have a problem processing the result
        if !city
          flash[:error] = "Sorry, we didn't understand the following city/country you entered:<br>#{i}"